In [3]:
%load_ext sql
%sql oracle+cx_oracle://hr:oracle@srv2.lan:1521/free

Connecting to 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

**Group by - Rollup (ab) (a) ()**

In [9]:
%%sql
WITH emplo AS 
    (SELECT * FROM EMPLOYEES WHERE JOB_ID IN ('IT_PROG','FI_MGR'))
SELECT job_id, DEPARTMENT_ID, avg(SALARy) , sum(salary)
from emplo E
group by rollup (JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------+---------------+-------------------------------------------+-------------+
|  job_id | department_id |                AVG(SALARY)                | SUM(SALARY) |
+---------+---------------+-------------------------------------------+-------------+
|  FI_MGR |      100      |                   12008                   |    12008    |
| IT_PROG |       60      |                    5760                   |    28800    |
|  FI_MGR |      None     |                   12008                   |    12008    |
| IT_PROG |      None     |                    5760                   |    28800    |
|   None  |      None     | 6801.333333333333333333333333333333333333 |    40808    |
+---------+---------------+-------------------------------------------+-------------+

**Group by - rollup - (ab) ()**

In [10]:
%%sql
WITH emplo AS 
    (SELECT * FROM EMPLOYEES WHERE JOB_ID IN ('IT_PROG','FI_MGR'))
SELECT job_id, DEPARTMENT_ID, avg(SALARy) , sum(salary)
from emplo E
group by rollup ((JOB_ID, DEPARTMENT_ID))

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------+---------------+-------------------------------------------+-------------+
|  job_id | department_id |                AVG(SALARY)                | SUM(SALARY) |
+---------+---------------+-------------------------------------------+-------------+
|  FI_MGR |      100      |                   12008                   |    12008    |
| IT_PROG |       60      |                    5760                   |    28800    |
|   None  |      None     | 6801.333333333333333333333333333333333333 |    40808    |
+---------+---------------+-------------------------------------------+-------------+

**Group by - (a) (b)**

In [11]:
%%sql
WITH emplo AS 
    (SELECT * FROM EMPLOYEES WHERE JOB_ID IN ('IT_PROG','FI_MGR'))
SELECT job_id, DEPARTMENT_ID, avg(SALARy) , sum(salary)
from emplo E
group by grouping sets (JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------+---------------+-------------+-------------+
|  job_id | department_id | AVG(SALARY) | SUM(SALARY) |
+---------+---------------+-------------+-------------+
|   None  |      100      |    12008    |    12008    |
|   None  |       60      |     5760    |    28800    |
|  FI_MGR |      None     |    12008    |    12008    |
| IT_PROG |      None     |     5760    |    28800    |
+---------+---------------+-------------+-------------+

**Summary - custom label - grouping**

In [12]:
%%sql
WITH emplo AS 
    (SELECT * FROM EMPLOYEES WHERE JOB_ID IN ('IT_PROG','FI_MGR'))
SELECT 
case when grouping(job_id) = 1 then '[MY SUMMARY LABEL]' else to_char(job_id) end as jobid, 
DEPARTMENT_ID, 
avg(SALARy) , 
sum(salary)
from emplo E
group by rollup (JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------------------+---------------+-------------------------------------------+-------------+
|       jobid        | department_id |                AVG(SALARY)                | SUM(SALARY) |
+--------------------+---------------+-------------------------------------------+-------------+
|       FI_MGR       |      100      |                   12008                   |    12008    |
|      IT_PROG       |       60      |                    5760                   |    28800    |
|       FI_MGR       |      None     |                   12008                   |    12008    |
|      IT_PROG       |      None     |                    5760                   |    28800    |
| [MY SUMMARY LABEL] |      None     | 6801.333333333333333333333333333333333333 |    40808    |
+--------------------+---------------+-------------------------------------------+-------------+

**Grouping id**

In [13]:
%%sql
WITH emplo AS (
    SELECT * FROM EMPLOYEES 
    WHERE JOB_ID IN ('IT_PROG', 'FI_MGR')
)
SELECT  
 GROUPING_ID(JOB_ID),
 GROUPING_ID(JOB_ID, DEPARTMENT_ID),

JOB_ID,
    CASE 
        WHEN GROUPING_ID(DEPARTMENT_ID) != 0 THEN '[TOTAL]'
        ELSE TO_CHAR(DEPARTMENT_ID) 
    END AS DEPARTMENT_ID_LABEL,

    AVG(SALARY) AS AVG_SALARY, 
    SUM(SALARY) AS TOTAL_SALARY

FROM emplo
GROUP BY ROLLUP(JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------------------+-----------------------------------+---------+---------------------+-------------------------------------------+--------------+
| GROUPING_ID(JOB_ID) | GROUPING_ID(JOB_ID,DEPARTMENT_ID) |  job_id | department_id_label |                 avg_salary                | total_salary |
+---------------------+-----------------------------------+---------+---------------------+-------------------------------------------+--------------+
|          0          |                 0                 |  FI_MGR |         100         |                   12008                   |    12008     |
|          0          |                 0                 | IT_PROG |          60         |                    5760                   |    28800     |
|          0          |                 1                 |  FI_MGR |       [TOTAL]       |                   12008                   |    12008     |
|          0          |                 1                 | IT_PROG |       [TOTAL]       |                    5760                   |    28800     |
|          1          |                 3                 |   None  |       [TOTAL]       | 6801.333333333333333333333333333333333333 |    40808     |
+---------------------+-----------------------------------+---------+---------------------+-------------------------------------------+--------------+

In [14]:
%%sql
WITH emplo AS (
    SELECT * FROM EMPLOYEES 
    WHERE JOB_ID IN ('IT_PROG', 'FI_MGR')
)
SELECT JOB_ID, DEPARTMENT_ID, 
       GROUPING_ID(JOB_ID, DEPARTMENT_ID) AS grouping_level
FROM emplo
GROUP BY ROLLUP(JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------+---------------+----------------+
|  job_id | department_id | grouping_level |
+---------+---------------+----------------+
|  FI_MGR |      100      |       0        |
| IT_PROG |       60      |       0        |
|  FI_MGR |      None     |       1        |
| IT_PROG |      None     |       1        |
|   None  |      None     |       3        |
+---------+---------------+----------------+

In [15]:
%%sql
WITH emplo AS (
    SELECT * FROM EMPLOYEES 
    WHERE JOB_ID IN ('IT_PROG', 'FI_MGR')
)
SELECT  
 GROUPING_ID(JOB_ID),
 GROUPING_ID(JOB_ID, DEPARTMENT_ID),

    #  JOB_ID,
    CASE 
        WHEN GROUPING_ID(JOB_ID, DEPARTMENT_ID) = 3 THEN 'TOTAL'
        WHEN GROUPING_ID(JOB_ID, DEPARTMENT_ID) = 2 THEN 'Agg for - ' ||JOB_ID||''
        WHEN GROUPING_ID(JOB_ID, DEPARTMENT_ID) = 1 THEN 'Agg for - '||JOB_ID||''
        ELSE 'No agg - ' || TO_CHAR(JOB_ID) 
    END AS JOB_ID_LABEL,
    # DEPARTMENT_ID,
    CASE 
        WHEN GROUPING_ID(JOB_ID) !=0  AND  GROUPING_ID(JOB_ID, DEPARTMENT_ID) != 0 THEN '[Total]'
        WHEN GROUPING_ID(JOB_ID, DEPARTMENT_ID) != 0 THEN '-'
        ELSE TO_CHAR(DEPARTMENT_ID) 
    END AS DEPARTMENT_ID_LABEL,
    AVG(SALARY) AS AVG_SALARY, 
    SUM(SALARY) AS TOTAL_SALARY

FROM emplo
GROUP BY ROLLUP(JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------------------+-----------------------------------+-------------------+---------------------+-------------------------------------------+--------------+
| GROUPING_ID(JOB_ID) | GROUPING_ID(JOB_ID,DEPARTMENT_ID) |    job_id_label   | department_id_label |                 avg_salary                | total_salary |
+---------------------+-----------------------------------+-------------------+---------------------+-------------------------------------------+--------------+
|          0          |                 0                 |  No agg - FI_MGR  |         100         |                   12008                   |    12008     |
|          0          |                 0                 |  No agg - IT_PROG |          60         |                    5760                   |    28800     |
|          0          |                 1                 |  Agg for - FI_MGR |          -          |                   12008                   |    12008     |
|          0          |                 1                 | Agg for - IT_PROG |          -          |                    5760                   |    28800     |
|          1          |                 3                 |       TOTAL       |       [Total]       | 6801.333333333333333333333333333333333333 |    40808     |
+---------------------+-----------------------------------+-------------------+---------------------+-------------------------------------------+--------------+

**Withing group, keep, pivot**

In [16]:
%%sql
select listagg(first_name || first_name || first_name || first_name || first_name || first_name || first_name ,', ') within group (order by 1) as too_long_varchar_exception
from EMPLOYEES

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

RuntimeError: (cx_Oracle.DatabaseError) ORA-01489: result of string concatenation is too long
[SQL: select listagg(first_name || first_name || first_name || first_name || first_name || first_name || first_name ,', ') within group (order by 1) as too_long_varchar_exception
from EMPLOYEES]
(Background on this error at: https://sqlalche.me/e/20/4xp6)
If you need help solving this issue, send us a message: https://ploomber.io/community

In [ ]:
%%sql
select 
    listagg(
        first_name || first_name || first_name || first_name || first_name || first_name || first_name  
        ,', '
        on overflow truncate 
         ' (...) SORRY TOO LONG. COUNTER: ' WITH COUNT)
    within group (order by 1) as layoffs
from EMPLOYEES

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 layoffs                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| EllenEllenEllenEllenEllenEllenEllen, SundarSundarSundarSundarSundarSundarSundar, MozheMozheMozheMozheMozheMozheMozhe, ShelliShelliShelliShelliShelliShelliShelli, AmitAmitAmitAmitAmitAmitAmit, ElizabethElizabethElizabethElizabethElizabethElizabethElizabeth, SarahSarahSarahSarahSarahSarahSarah, DavidDavidDavidDavidDavidDavidDavid, LauraLauraLauraLauraLauraLauraLaura, HarrisonHarrisonHarrisonHarrisonHarrisonHarrisonHarrison, HermannHermannHermannHermannHermannHermannHermann, AlexisAlexisAlexisAlexisAlexisAlexisAlexis, AnthonyAnthonyAnthonyAnthonyAnthonyAnthonyAnthony, GeraldGeraldGeraldGeraldGeraldGeraldGerald, NanetteNanetteNanetteNanetteNanetteNanetteNanette, JohnJohnJohnJohnJohnJohnJohn, KellyKellyKellyKellyKellyKellyKelly, KarenKarenKarenKarenKarenKarenKaren, CurtisCurtisCurtisCurtisCurtisCurtisCurtis, PatPatPatPatPatPatPat, JuliaJuliaJuliaJuliaJuliaJuliaJulia, JenniferJenniferJenniferJenniferJenniferJenniferJennifer, LouiseLouiseLouiseLouiseLouiseLouiseLouise, AlbertoAlbertoAlbertoAlbertoAlbertoAlbertoAlberto, BritneyBritneyBritneyBritneyBritneyBritneyBritney, DanielDanielDanielDanielDanielDanielDaniel, KevinKevinKevinKevinKevinKevinKevin, JeanJeanJeanJeanJeanJeanJean, TaylerTaylerTaylerTaylerTaylerTaylerTayler, AdamAdamAdamAdamAdamAdamAdam, LexLexLexLexLexLexLex, KiKiKiKiKiKiKi, GirardGirardGirardGirardGirardGirardGirard, WilliamWilliamWilliamWilliamWilliamWilliamWilliam, DouglasDouglasDouglasDouglasDouglasDouglasDouglas, KimberelyKimberelyKimberelyKimberelyKimberelyKimberelyKimberely, DanielleDanielleDanielleDanielleDanielleDanielleDanielle, NancyNancyNancyNancyNancyNancyNancy, PeterPeterPeterPeterPeterPeterPeter, ShelleyShelleyShelleyShelleyShelleyShelleyShelley, GuyGuyGuyGuyGuyGuyGuy, AlyssaAlyssaAlyssaAlyssaAlyssaAlyssaAlyssa, ValliValliValliValliValliValliValli, SusanSusanSusanSusanSusanSusanSusan, AlexanderAlexanderAlexanderAlexanderAlexanderAlexanderAlexander, CharlesCharlesCharlesCharlesCharlesCharlesCharles, VanceVanceVanceVanceVanceVanceVance, PayamPayamPayamPayamPayamPayamPayam, AlexanderAlexanderAlexanderAlexanderAlexanderAlexanderAlexander, JanetteJanetteJanetteJanetteJanetteJanetteJanette, StevenStevenStevenStevenStevenStevenSteven, SunditaSunditaSunditaSunditaSunditaSunditaSundita, RenskeRenskeRenskeRenskeRenskeRenskeRenske, JamesJamesJamesJamesJamesJamesJames, DavidDavidDavidDavidDavidDavidDavid, DenDenDenDenDenDenDen, JackJackJackJackJackJackJack, JasonJasonJasonJasonJasonJasonJason, StevenStevenStevenStevenStevenStevenSteven, JamesJamesJamesJamesJamesJamesJames, MichaelMichaelMichaelMichaelMichaelMichaelMichael, MatteaMatteaMatteaMatteaMatteaMatteaMattea, RandallRandallRandallRandallRandallRandallRandall, AllanAllanAllanAllanAllanAllanAllan, SamuelSamuelSamuelSamuelSamuelSamuelSamuel, IreneIreneIreneIreneIreneIreneIrene, BruceBruceBruceBruceBruceBruceBruce, KevinKevinKevinKevinKevinKevinKevin, JuliaJuliaJuliaJuliaJuliaJuliaJulia, DianaDianaDianaDianaDianaDianaDiana, DonaldDonaldDonaldDonaldDonaldDonaldDonald, ChristopherChristopherChristopherChristopherChristopherChristopherChristopher, TJTJTJTJTJTJTJ, LisaLisaLisaLisaLisaLisaLisa, KarenKarenKarenKarenKarenKarenKaren, JoshuaJoshuaJoshuaJoshuaJoshuaJoshuaJoshua, RandallRandallRandallRandallRandallRandallRandall, HazelHazelHazelHazelHazelHazelHazel, LuisLuisLuisLuisLuisLuisLuis, TrennaTrennaTrennaTrennaTrennaTrennaTrenna, MichaelMichaelMichaelMichaelMichaelMichaelMichael, NanditaNanditaNanditaNanditaNanditaNanditaNandita, IsmaelIsmaelIsmaelIsmaelIsmaelIsmaelIsmael, JohnJohnJohnJohnJohnJohnJohn, SarathSarathSarathSarathSarathSarathSarath, JohnJohnJohnJohnJohnJohnJohn, LindseyLindseyLindseyLindseyLindseyLindseyLindsey, WilliamWilliamWilliamWilliamWilliamWilliamWilliam, StephenStephenStephenStephenStephenStephenStephen, MarthaMarthaMarthaMarthaMarthaMarthaMartha, PatrickPatrickPatrickPatrickPatrickPatrickPatrick, JonathonJonathonJonathonJonathonJonathonJonathonJonathon,  (...) SORRY TOO LONG. COUNTER: (15) |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

In [ ]:
%%sql
SELECT 
    CASE 
        WHEN LENGTH(LISTAGG(first_name, ', ') WITHIN GROUP (ORDER BY first_name)) > 4000 
        THEN SUBSTR(LISTAGG(first_name, ', ') WITHIN GROUP (ORDER BY first_name), 1, 3997) || '...'
        ELSE LISTAGG(first_name, ', ') WITHIN GROUP (ORDER BY first_name) 
    END AS before_oracle_12
FROM employees

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                                                                                                                                                                                                                                                                                                                                           before_oracle_12                                                                                                                                                                                                                                                                                                                                                                                                                          |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Adam, Alana, Alberto, Alexander, Alexander, Alexis, Allan, Alyssa, Amit, Anthony, Britney, Bruce, Charles, Christopher, Clara, Curtis, Daniel, Danielle, David, David, David, Den, Diana, Donald, Douglas, Eleni, Elizabeth, Ellen, Gerald, Girard, Guy, Harrison, Hazel, Hermann, Irene, Ismael, Jack, James, James, Janette, Jason, Jean, Jennifer, Jennifer, John, John, John, Jonathon, Jose Manuel, Joshua, Julia, Julia, Karen, Karen, Kelly, Kevin, Kevin, Ki, Kimberely, Laura, Lex, Lindsey, Lisa, Louise, Luis, Martha, Mattea, Matthew, Michael, Michael, Mozhe, Nancy, Nandita, Nanette, Neena, Oliver, Pat, Patrick, Payam, Peter, Peter, Randall, Randall, Renske, Samuel, Sarah, Sarath, Sean, Shanta, Shelley, Shelli, Sigal, Stephen, Steven, Steven, Sundar, Sundita, Susan, TJ, Tayler, Timothy, Trenna, Valli, Vance, William, William, Winston |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

**Within group - rank etc**

In [ ]:
%%sql
WITH emp AS (
    SELECT * FROM EMPLOYEES 
    WHERE JOB_ID IN ('IT_PROG')
)
SELECT *
FROM emp

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-------------+------------+-----------+-----------+----------------+---------------------+---------+--------+----------------+------------+---------------+
| employee_id | first_name | last_name |   email   |  phone_number  |      hire_date      |  job_id | salary | commission_pct | manager_id | department_id |
+-------------+------------+-----------+-----------+----------------+---------------------+---------+--------+----------------+------------+---------------+
|     103     | Alexander  |   James   |   AJAMES  | 1.590.555.0103 | 2016-01-03 00:00:00 | IT_PROG |  9000  |      None      |    102     |       60      |
|     104     |   Bruce    |   Miller  |  BMILLER  | 1.590.555.0104 | 2017-05-21 00:00:00 | IT_PROG |  6000  |      None      |    103     |       60      |
|     105     |   David    |  Williams | DWILLIAMS | 1.590.555.0105 | 2015-06-25 00:00:00 | IT_PROG |  4800  |      None      |    103     |       60      |
|     106     |   Valli    |  Jackson  |  VJACKSON | 1.590.555.0106 | 2016-02-05 00:00:00 | IT_PROG |  4800  |      None      |    103     |       60      |
|     107     |   Diana    |   Nguyen  |  DNGUYEN  | 1.590.555.0107 | 2017-02-07 00:00:00 | IT_PROG |  4200  |      None      |    103     |       60      |
+-------------+------------+-----------+-----------+----------------+---------------------+---------+--------+----------------+------------+---------------+

In [ ]:
%%sql
WITH emp AS (
    SELECT * FROM EMPLOYEES 
    WHERE JOB_ID IN ('IT_PROG')
)
SELECT rank(10000) within group (order by salary desc) as rank_pos_when_salary_equals_10000usd
FROM emp

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------------------------------------+
| rank_pos_when_salary_equals_10000usd |
+--------------------------------------+
|                  1                   |
+--------------------------------------+

In [ ]:
%%sql
SELECT *
    # e.employee_id
    # ,percent_rank(TO_DATE('2015-01-01','YYYY-MM-DD')) within group (order by e.START_DATE)
from JOB_HISTORY E
# GROUP BY  e.employee_id

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-------------+---------------------+---------------------+------------+---------------+
| employee_id |      start_date     |       end_date      |   job_id   | department_id |
+-------------+---------------------+---------------------+------------+---------------+
|     102     | 2011-01-13 00:00:00 | 2016-07-24 00:00:00 |  IT_PROG   |       60      |
|     101     | 2007-09-21 00:00:00 | 2011-10-27 00:00:00 | AC_ACCOUNT |      110      |
|     101     | 2011-10-28 00:00:00 | 2015-03-15 00:00:00 |   AC_MGR   |      110      |
|     201     | 2014-02-17 00:00:00 | 2017-12-19 00:00:00 |   MK_REP   |       20      |
|     114     | 2016-03-24 00:00:00 | 2017-12-31 00:00:00 |  ST_CLERK  |       50      |
|     122     | 2017-01-01 00:00:00 | 2017-12-31 00:00:00 |  ST_CLERK  |       50      |
|     200     | 2005-09-17 00:00:00 | 2011-06-17 00:00:00 |  AD_ASST   |       90      |
|     176     | 2016-03-24 00:00:00 | 2016-12-31 00:00:00 |   SA_REP   |       80      |
|     176     | 2017-01-01 00:00:00 | 2017-12-31 00:00:00 |   SA_MAN   |       80      |
|     200     | 2012-07-01 00:00:00 | 2016-12-31 00:00:00 | AC_ACCOUNT |       90      |
+-------------+---------------------+---------------------+------------+---------------+
Truncated to displaylimit of 10.

**percent_rank**
bug or feature?:

In [ ]:
%%sql
SELECT
     e.employee_id || ' | ' || TO_CHAR(E.START_DATE,'YYYY-MM-DD') AS COL1
     ,percent_rank(TO_DATE('2015-01-01','YYYY-MM-DD')) within group (order by e.START_DATE) AS IS_EARLIER
from JOB_HISTORY E
GROUP BY    e.employee_id || ' | ' || TO_CHAR(E.START_DATE,'YYYY-MM-DD')

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+------------------+------------+
|       col1       | is_earlier |
+------------------+------------+
| 101 | 2007-09-21 |     1      |
| 101 | 2011-10-28 |     1      |
| 102 | 2011-01-13 |     1      |
| 114 | 2016-03-24 |     0      |
| 122 | 2017-01-01 |     0      |
| 176 | 2016-03-24 |     0      |
| 176 | 2017-01-01 |     0      |
| 200 | 2005-09-17 |     1      |
| 200 | 2012-07-01 |     1      |
| 201 | 2014-02-17 |     1      |
+------------------+------------+
Truncated to displaylimit of 10.

In [ ]:
%%sql
SELECT
    e.employee_id || ' | ' || TO_CHAR(e.start_date, 'YYYY-MM-DD') AS COL1,
    DENSE_RANK() OVER (ORDER BY e.start_date) AS IS_EARLIER
FROM JOB_HISTORY e

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+------------------+------------+
|       col1       | is_earlier |
+------------------+------------+
| 200 | 2005-09-17 |     1      |
| 101 | 2007-09-21 |     2      |
| 102 | 2011-01-13 |     3      |
| 101 | 2011-10-28 |     4      |
| 200 | 2012-07-01 |     5      |
| 201 | 2014-02-17 |     6      |
| 114 | 2016-03-24 |     7      |
| 176 | 2016-03-24 |     7      |
| 176 | 2017-01-01 |     8      |
| 122 | 2017-01-01 |     8      |
+------------------+------------+
Truncated to displaylimit of 10.

In [17]:
%%sql
SELECT COUNT(DISTINCT START_DATE) FROM JOB_HISTORY

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------------------------+
| COUNT(DISTINCTSTART_DATE) |
+---------------------------+
|             8             |
+---------------------------+

In [20]:
%reload_ext sql
%sql oracle+cx_oracle://HR:oracle@srv2.lan:1521/free

Connecting and switching to connection 'oracle+cx_oracle://HR:***@srv2.lan:1521/free'

**Max value - Keep vs order by**

In [ ]:
%%sql
SELECT
max(e.employee_id) KEEP (DENSE_RANK first ORDER BY e.salary desc) as employee_id,
max(e.salary) as salary
FROM HR.EMPLOYEES e

Running query in 'oracle+cx_oracle://HR:***@srv2.lan:1521/free'

+-------------+--------+
| employee_id | salary |
+-------------+--------+
|     100     | 24000  |
+-------------+--------+

In [70]:
%%sql
EXPLAIN PLAN FOR
select 
employee_id,
salary 
from EMPLOYEES e
order by salary desc
fetch first 1 rows only

Running query in 'oracle+cx_oracle://HR:***@srv2.lan:1521/free'

++
||
++
++

In [66]:
%%sql
SELECT * FROM TABLE(DBMS_XPLAN.DISPLAY)

Running query in 'oracle+cx_oracle://HR:***@srv2.lan:1521/free'

+---------------------------------------------------------------------------------------+
|                                   plan_table_output                                   |
+---------------------------------------------------------------------------------------+
|                               Plan hash value: 460450477                              |
|                                                                                       |
| ------------------------------------------------------------------------------------- |
| | Id  | Operation               | Name      | Rows  | Bytes | Cost (%CPU)| Time     | |
| ------------------------------------------------------------------------------------- |
| |   0 | SELECT STATEMENT        |           |     1 |    26 |     4  (25)| 00:00:01 | |
| |*  1 |  COUNT STOPKEY          |           |       |       |            |          | |
| |   2 |   VIEW                  |           |   107 |  2782 |     4  (25)| 00:00:01 | |
| |*  3 |    SORT ORDER BY STOPKEY|           |   107 |   856 |     4  (25)| 00:00:01 | |
| |   4 |     TABLE ACCESS FULL   | EMPLOYEES |   107 |   856 |     3   (0)| 00:00:01 | |
+---------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [101]:
%%sql
EXPLAIN PLAN FOR
SELECT
max(e.employee_id) KEEP (DENSE_RANK first ORDER BY e.salary desc) as employee_id_highest_salary,
max(e.salary) as salary
FROM HR.EMPLOYEES e

Running query in 'oracle+cx_oracle://HR:***@srv2.lan:1521/free'

++
||
++
++

In [83]:
%%sql
SELECT * FROM TABLE(DBMS_XPLAN.DISPLAY)

Running query in 'oracle+cx_oracle://HR:***@srv2.lan:1521/free'

+----------------------------------------------------------------------------------+
|                                plan_table_output                                 |
+----------------------------------------------------------------------------------+
|                           Plan hash value: 1756381138                            |
|                                                                                  |
| -------------------------------------------------------------------------------- |
| | Id  | Operation          | Name      | Rows  | Bytes | Cost (%CPU)| Time     | |
| -------------------------------------------------------------------------------- |
| |   0 | SELECT STATEMENT   |           |     1 |     8 |     3   (0)| 00:00:01 | |
| |   1 |  SORT AGGREGATE    |           |     1 |     8 |            |          | |
| |   2 |   TABLE ACCESS FULL| EMPLOYEES |   107 |   856 |     3   (0)| 00:00:01 | |
| -------------------------------------------------------------------------------- |
+----------------------------------------------------------------------------------+

- Don't use KEEP when aggregation alone gives you all the necessary information.
- Use KEEP when you need additional context, such as retrieving an extra attribute related to your aggregated function (e.g., employee_id for MAX(salary)).
- Be careful! KEEP can return more than one row if multiple records share the same ranking. In such cases, you must use MIN() or MAX() to pick one value. (If only one row is returned, MIN() and MAX() will give the same result.)
- If you need all matching values in a single cell, use LISTAGG WITHIN GROUP instead of KEEP.

In [39]:
%%sql
SELECT
max(e.employee_id) KEEP (DENSE_RANK first ORDER BY e.salary desc) as emp_highest_salary_group,
min(e.employee_id) KEEP (DENSE_RANK first ORDER BY e.salary desc) as emp_highest_salary_group_but_min, --be_careful!
LISTAGG(employee_id, ', ') WITHIN GROUP (ORDER BY salary DESC) AS all_top_employees, -- within group just concat grouped values, keep - return only first or last, but can be subset
max(e.employee_id) as emp_just_nonsense_max_id,
max(e.salary) as max_salary
FROM HR.EMPLOYEES e
group by job_id

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------------------------+----------------------------------+-------------------------+--------------------------+------------+
| emp_highest_salary_group | emp_highest_salary_group_but_min |    all_top_employees    | emp_just_nonsense_max_id | max_salary |
+--------------------------+----------------------------------+-------------------------+--------------------------+------------+
|           206            |               206                |           206           |           206            |    8300    |
|           205            |               205                |           205           |           205            |   12008    |
|           200            |               200                |           200           |           200            |    4400    |
|           100            |               100                |           100           |           100            |   24000    |
|           102            |               101                |         101, 102        |           102            |   17000    |
|           109            |               109                | 109, 110, 112, 111, 113 |           113            |    9000    |
|           108            |               108                |           108           |           108            |   12008    |
|           203            |               203                |           203           |           203            |    6500    |
|           103            |               103                | 103, 104, 105, 106, 107 |           107            |    9000    |
|           201            |               201                |           201           |           201            |   13000    |
+--------------------------+----------------------------------+-------------------------+--------------------------+------------+
Truncated to displaylimit of 10.

## Case Study: summing salary per department with department name - breakdown

In [83]:
%%sql
--1 inappropriate, grouping without key
EXPLAIN PLAN FOR
select sum(e.salary), d.department_name
from employees e
left join departments d on d.department_id = e.department_id
group by d.department_name
FETCH FIRST 5 ROWS ONLY

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

++
||
++
++

In [84]:
%%sql
SELECT * FROM TABLE(DBMS_XPLAN.DISPLAY)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-------------------------------------------------------------------------------------------------+
|                                        plan_table_output                                        |
+-------------------------------------------------------------------------------------------------+
|                                    Plan hash value: 201460046                                   |
|                                                                                                 |
| ----------------------------------------------------------------------------------------------- |
| | Id  | Operation                       | Name        | Rows  | Bytes | Cost (%CPU)| Time     | |
| ----------------------------------------------------------------------------------------------- |
| |   0 | SELECT STATEMENT                |             |     5 |   150 |     4  (25)| 00:00:01 | |
| |*  1 |  COUNT STOPKEY                  |             |       |       |            |          | |
| |   2 |   VIEW                          |             |   107 |  3210 |     4  (25)| 00:00:01 | |
| |*  3 |    SORT GROUP BY STOPKEY        |             |   107 |  5992 |     4  (25)| 00:00:01 | |
| |   4 |     NESTED LOOPS OUTER          |             |   107 |  5992 |     3   (0)| 00:00:01 | |
+-------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [ ]:
%%sql
--2a subquery
EXPLAIN PLAN FOR
select sum, d.department_name
from (
    select sum(e.salary) as sum, e.department_id as department_id
    from employees e
    group by e.department_id
) e
join departments d on e.DEPARTMENT_ID = d.department_id
order by d.department_id asc
FETCH FIRST 5 ROWS ONLY

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

++
||
++
++

In [86]:
%%sql
SELECT * FROM TABLE(DBMS_XPLAN.DISPLAY)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-------------------------------------------------------------------------------------------------------+
|                                           plan_table_output                                           |
+-------------------------------------------------------------------------------------------------------+
|                                      Plan hash value: 3959437933                                      |
|                                                                                                       |
| ----------------------------------------------------------------------------------------------------- |
| | Id  | Operation                       | Name              | Rows  | Bytes | Cost (%CPU)| Time     | |
| ----------------------------------------------------------------------------------------------------- |
| |   0 | SELECT STATEMENT                |                   |     5 |   150 |     4  (25)| 00:00:01 | |
| |*  1 |  COUNT STOPKEY                  |                   |       |       |            |          | |
| |   2 |   VIEW                          |                   |    11 |   330 |     4  (25)| 00:00:01 | |
| |*  3 |    SORT GROUP BY STOPKEY        |                   |    11 |   748 |     4  (25)| 00:00:01 | |
| |   4 |     NESTED LOOPS                |                   |   106 |  7208 |     3   (0)| 00:00:01 | |
+-------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [87]:
%%sql
--2b subquery + with
EXPLAIN PLAN FOR
with sq as (
    select sum(e.salary) as sum, e.department_id as department_id
    from employees e
    group by e.department_id
)
select sum, d.department_name
from sq e
join departments d on e.DEPARTMENT_ID = d.department_id
order by d.department_id asc
FETCH FIRST 5 ROWS ONLY

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

++
||
++
++

In [88]:
%%sql
SELECT * FROM TABLE(DBMS_XPLAN.DISPLAY)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-------------------------------------------------------------------------------------------------------+
|                                           plan_table_output                                           |
+-------------------------------------------------------------------------------------------------------+
|                                      Plan hash value: 3959437933                                      |
|                                                                                                       |
| ----------------------------------------------------------------------------------------------------- |
| | Id  | Operation                       | Name              | Rows  | Bytes | Cost (%CPU)| Time     | |
| ----------------------------------------------------------------------------------------------------- |
| |   0 | SELECT STATEMENT                |                   |     5 |   150 |     4  (25)| 00:00:01 | |
| |*  1 |  COUNT STOPKEY                  |                   |       |       |            |          | |
| |   2 |   VIEW                          |                   |    11 |   330 |     4  (25)| 00:00:01 | |
| |*  3 |    SORT GROUP BY STOPKEY        |                   |    11 |   748 |     4  (25)| 00:00:01 | |
| |   4 |     NESTED LOOPS                |                   |   106 |  7208 |     3   (0)| 00:00:01 | |
+-------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [89]:
%%sql
--3 unnecessarily complicated
EXPLAIN PLAN FOR
SELECT 
SUM(E.salary) AS SUM
,D.department_id AS ID
,MIN(D.department_name) KEEP (DENSE_RANK FIRST ORDER BY D.department_id ASC) department_name
FROM employees E
LEFT JOIN departments D ON D.department_id = E.department_id
GROUP BY D.department_id
ORDER BY D.department_id ASC
FETCH FIRST 5 ROWS ONLY

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

++
||
++
++

In [90]:
%%sql
SELECT * FROM TABLE(DBMS_XPLAN.DISPLAY)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-------------------------------------------------------------------------------------------------+
|                                        plan_table_output                                        |
+-------------------------------------------------------------------------------------------------+
|                                    Plan hash value: 201460046                                   |
|                                                                                                 |
| ----------------------------------------------------------------------------------------------- |
| | Id  | Operation                       | Name        | Rows  | Bytes | Cost (%CPU)| Time     | |
| ----------------------------------------------------------------------------------------------- |
| |   0 | SELECT STATEMENT                |             |     5 |   215 |     4  (25)| 00:00:01 | |
| |*  1 |  COUNT STOPKEY                  |             |       |       |            |          | |
| |   2 |   VIEW                          |             |    11 |   473 |     4  (25)| 00:00:01 | |
| |*  3 |    SORT GROUP BY STOPKEY        |             |    11 |   616 |     4  (25)| 00:00:01 | |
| |   4 |     NESTED LOOPS OUTER          |             |   107 |  5992 |     3   (0)| 00:00:01 | |
+-------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [91]:
%%sql
--4 simple & best
EXPLAIN PLAN FOR
SELECT 
  SUM(e.salary) AS sum,
  d.department_id,
  MIN(d.department_name) AS department_name
FROM employees e
LEFT JOIN departments d ON d.department_id = e.department_id
GROUP BY d.department_id
ORDER BY d.department_id ASC
FETCH FIRST 5 ROWS ONLY

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

++
||
++
++

In [92]:
%%sql
SELECT * FROM TABLE(DBMS_XPLAN.DISPLAY)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-------------------------------------------------------------------------------------------------+
|                                        plan_table_output                                        |
+-------------------------------------------------------------------------------------------------+
|                                    Plan hash value: 201460046                                   |
|                                                                                                 |
| ----------------------------------------------------------------------------------------------- |
| | Id  | Operation                       | Name        | Rows  | Bytes | Cost (%CPU)| Time     | |
| ----------------------------------------------------------------------------------------------- |
| |   0 | SELECT STATEMENT                |             |     5 |   215 |     4  (25)| 00:00:01 | |
| |*  1 |  COUNT STOPKEY                  |             |       |       |            |          | |
| |   2 |   VIEW                          |             |    11 |   473 |     4  (25)| 00:00:01 | |
| |*  3 |    SORT GROUP BY STOPKEY        |             |    11 |   616 |     4  (25)| 00:00:01 | |
| |   4 |     NESTED LOOPS OUTER          |             |   107 |  5992 |     3   (0)| 00:00:01 | |
+-------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

## Pivot

In [114]:
%%sql
SELECT job_id,
COUNT(case when to_char(start_date,'yyyy') = '2011' then 1 end) r11
,COUNT(case when to_char(start_date,'yyyy') = '2016' then 1 end) r16
,COUNT(case when to_char(start_date,'yyyy') = '2017' then 1 end) r17
FROM job_history
group by job_id

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+------------+-----+-----+-----+
|   job_id   | r11 | r16 | r17 |
+------------+-----+-----+-----+
| AC_ACCOUNT |  0  |  0  |  0  |
|   AC_MGR   |  1  |  0  |  0  |
|  AD_ASST   |  0  |  0  |  0  |
|  IT_PROG   |  1  |  0  |  0  |
|   MK_REP   |  0  |  0  |  0  |
|   SA_MAN   |  0  |  0  |  1  |
|   SA_REP   |  0  |  1  |  0  |
|  ST_CLERK  |  0  |  1  |  1  |
+------------+-----+-----+-----+

In [119]:
%%sql
SELECT *
FROM (
    SELECT job_id,
           to_char(start_date, 'yyyy') AS year
    FROM job_history
)
PIVOT (
    count(1) FOR year IN ('2011' AS "2011", '2016' AS "2016", '2017' AS "2017")
)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+------------+------+------+------+
|   job_id   | 2011 | 2016 | 2017 |
+------------+------+------+------+
| AC_ACCOUNT |  0   |  0   |  0   |
|   AC_MGR   |  1   |  0   |  0   |
|  AD_ASST   |  0   |  0   |  0   |
|  IT_PROG   |  1   |  0   |  0   |
|   MK_REP   |  0   |  0   |  0   |
|   SA_MAN   |  0   |  0   |  1   |
|   SA_REP   |  0   |  1   |  0   |
|  ST_CLERK  |  0   |  1   |  1   |
+------------+------+------+------+